{"text": "This is a course in the algebra of matrices and Euclidean spaces that emphasizes the concrete and geometric. Topics to be developed include: solving systems of linear equations; matrix addition, scalar multiplication,\nand\nmultiplication, properties of invertible matrices; determinants; elements of the theory of abstract finite dimensional real vector spaces; dimension of vector spaces; and the rank of a matrix. These ideas are used to\ndevelop\nbasic ideas of Euclidean geometry and to illustrate the behavior of linear systems. We conclude with a discussion of eigenvalues and the diagonalization of matrices. For a more conceptual treatment of linear algebra,\nstudents\nshould enroll in MATH223.\n\nMAJOR READINGS\n\nTo be announced.\n\nEXAMINATIONS AND ASSIGNMENTS\n\nTwo midterm exams, homework assignments, final exam for most sections, various problem sets and occasional quizzes for some sections. Students will take midterm exams at 7:30 p.m. on Monday, October 10 and Wednesday,\nNovmber 16.\n\nADDITIONAL REQUIREMENTS and/or COMMENTS\n\nMATH121, 122 or the high school equivalent is strongly recommended as background, but not required."}
{"text": "MATH32012 Commutative Algebra - 2012/13, Semester 2\n\nOnline Test\n\nThe Online Test is currently accessible via the MATH32012 course content page in Blackboard.\nYou may retake the test for revision purposes (e.g., to practise\nthe computation of Gröbner bases). It will not affect your coursework mark.\n(The coursework marks have been finalised and are available via the Grade\nCentre in Blackboard.)\n\nModule description and prerequisites\n\nYou should have general facility for dealing with algebraic structures: complex numbers, sets, groups, rings, fields. For this reason, MATH20212 Algebraic Structures 2 is a prerequisite.\n\nAbout the course\n\nMany find MATH32012 Commutative Algebra the most advanced abstract algebra course they take as part of their degree.\nNevertheless, the content of the course is not just a sequence of theorems and proofs.\nYou are expected to learn methods of algebraic computation relating to polynomials in several variables.\n\nSolving equations has been a driving force of algebra at least since the Babylonians learned to solve quadratic equations some 3700 years ago. The subject matter of this course is, however, informed by more recent developments.\n\nThe work of Hilbert in late 19th - 20th century was key to the modern treatment of multivariate polynomials and provided a basis for commutative algebra and algebraic geometry. His result that every (consistent) system of polynomial equations over an algebraically closed field has at least one solution is known as the Nullstellensatz.\nBut an efficient method of finding such solutions by elimination was not found until 1965, when Buchberger invented Gröbner bases.\n\nIn the course, key theorems about the ring of polynomials in several variables will be rigorously proved.\nAlgorithms relating to polynomials will be explained and supported by examples. This includes factorising polynomials into irreducible factors and computing a Gröbner basis of an ideal.\n\nResults and methods of Commutative Algebra have applications in various branches of mathematics and computer science. Here are some puzzles which we may use in the course as an illustration for the main content. You are welcome to have a go at solving them!\n\nQuestion 1 (Fermat, 17th century).\nFind all integers a \"sandwiched\" between a square and a cube.\n\nQuestion 2.\nHow many ways are there of placing 8 queens on a chessboard so that no two queens attack each other? What about n queens on an n×n chessboard?\n\nQuestion 3.\nHow many distinct Sudoku boards are there? (A Sudoku board is a 9×9 square\nwith a number from 1 to 9 in each cell, satisfying the Sudoku constraints.)\n\nimages from Wikimedia commons\n\nCoursework\n\nThere will be 2 pieces of assessed coursework:\n\nAssessed homework 1 (see a link above): a take-home problem sheet\nset on Wednesday 27 February (week 5),\ndue on Tuesday 12 March (week 7) at 4pm.\n\nBlackboard-based online test: a timed, open-book test which the students complete online; multiple attempts are allowed\n\nPrevious years' exams\n\nCommutative algebra exam papers from years 2008-2012 are available here."}
{"text": "\"Math software\" is a very general term, which encompasses computer algebra systems like Maxima and Mathematica, numerical computing environments like Matlab, and basic graphing calculators. It sounds like you want the third kind. – Rahul NarainOct 27 '10 at 7:57"}
{"text": "Info for Students\n\nAlgebra Nation was created especially to help YOU succeed on the Algebra End-of-Course (EOC) exam.\n\nAlgebra Nation is meant for you to use on your own time. You're a busy student with lots of other activities and responsibilities. Forgot how to solve literal equations when you're starting homework at 9PM? Hop onto Algebra Nation and watch Zach and other Study Experts break it down for you. Want to ask a question while you're waiting for the bus? Grab your smartphone, snap a picture of your homework question, and post it to the wall. Want to get some extra practice before a test or quiz? Try out the \"Test Yourself!\" practice tool, which tells you exactly what you answered correctly or incorrectly, offers a video that teaches you exactly how to solve the problem, and directs you to the videos that will help you brush up on your skills.\n\nWhat are you waiting for? Work smarter, not harder and try Algebra Nation out.\n\nAll you have to do is click the \"Enter Algebra Nation\" button on AlgebraNation.com Follow the on-screen directions and get started today. Watch the Introduction to Algebra Nation video above for more information!"}
{"text": "Transforming? There is a step before applying the technique of \"completing the square\" that is required and that is to come up with the technique of completing the square in the first place. You're not suggesting that the purpose of a course in elementary algebra is to just teach a finite set of techniques to be memorized, understood and used when appropriate, are you? Although I agree that is a subset of the purpose of an algebra class, that still leaves a lot of gaps in between those (finite number of) techniques taught in an algebra class and the only way to fill those gaps is that the student also develop the skill to invent new solutions without prior art. And some techniques, even though they are labeled \"techniques\" are not algorithmic or formulaic at all, such as substitution of variables or induction. Most students are poor with these because they are just a very high level form and the student must fill in the form with a solution. Call it study, call it practice, call it whatever, but there is a lot of brain work left to do even after you see that a technique works.\n\nBob Hansen\n\nOn Jul 18, 2012, at 3:03 PM, Louis Talman wrote:\n\n> And, in particular, I never thought of learning to complete a square as \"studying the solution of quadratic equations\". I thought of it, instead, as a way of transforming an expression into an equivalent expression that was more useful in a given context."}
